Catalogs/абс_НастройкиВыгрузкиДанныхПУБ77/абс_НастройкиВыгрузкиДанныхПУБ77.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>абс_НастройкиВыгрузкиДанныхПУБ77</name>
  <attributes>
    <name>Использование</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КаталогВыгрузкиДанных</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Дата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьРегламентныеЗадания</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РегламентноеЗадание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>40</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПрефиксФайлаВыгрузки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипФайлаВыгрузки</name>
    <type>
      <types>EnumRef.абс_ТипФайлаВыгрузки</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОграничения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ХозяйственнаяОперация</name>
    <type>
      <types>CatalogRef.абс_ХозяйственныеОперацииПУБ77</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ХозяйственныеОперации</name>
    <attributes>
      <name>ХозяйственнаяОперация</name>
      <type>
        <types>CatalogRef.абс_ХозяйственныеОперацииПУБ77</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Catalogs/абс_НастройкиВыгрузкиДанныхПУБ77/Forms/ФормаЭлемента/Module.bsl
&НаСервере
Перем мРегламентноеЗадание;

&НаКлиенте
Процедура КаталогВыгрузкиДанныхНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
    Если Диалог.Выбрать() Тогда
        Объект.КаталогВыгрузкиДанных = Диалог.Каталог;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция НайтиРеглЗаданиеПоПараметру(УникальныйНомерЗадания)
	
	Попытка
		
		Если НЕ ПустаяСтрока(УникальныйНомерЗадания) Тогда
			
			УникальныйИдентификаторЗадания = Новый УникальныйИдентификатор(УникальныйНомерЗадания);
			ТекущееРегламентноеЗадание = РегламентныеЗадания.НайтиПоУникальномуИдентификатору(УникальныйИдентификаторЗадания);
			
		Иначе
			
			ТекущееРегламентноеЗадание = Неопределено;
			
		КонецЕсли;
		
	Исключение
		
		ТекущееРегламентноеЗадание = Неопределено;
		
    КонецПопытки;
	
	Возврат ТекущееРегламентноеЗадание;
	
КонецФункции

&НаСервере
Функция НайтиРегламентноеЗаданиеПоНастройке() Экспорт
	
	ТекущееРегламентноеЗадание = НайтиРеглЗаданиеПоПараметру(Объект.РегламентноеЗадание);
	
	Возврат ТекущееРегламентноеЗадание;
	
КонецФункции

&НаСервере
Процедура УстановитьЗначенияПеременныхРегламентныхНастроек() Экспорт
	
	Если мРегламентноеЗадание = Неопределено Тогда
		
		мРегламентноеЗадание = НайтиРегламентноеЗаданиеПоНастройке();
			
	КонецЕсли;	
			
КонецПроцедуры

&НаСервере
Процедура ПолучитьТекстЗаголовкаИРасписанияРегламентнойНастройки(Задание, ТекстЗаголовка, ТекстРасписания, РасписаниеАктивно) Экспорт
	
	РасписаниеАктивно = Ложь;
	
	ТекстЗаголовка = "Дополнительные настройки расписания ...";
	
	Если Задание = Неопределено Тогда
		
		//ТекстЗаголовка = "Создать регламентную настройку ...";	
		ТекстРасписания = "<Расписание не задано>";
		
	Иначе
		
		//ТекстЗаголовка = "Дополнительные настройки расписания ...";
		Если Задание.Использование Тогда
			ПрефиксРасписания = "Расписание: ";
			РасписаниеАктивно = Истина;
		Иначе
			ПрефиксРасписания = "Расписание: ";
		КонецЕсли;
		
		ТекстРасписания = ПрефиксРасписания + Строка(Задание.Расписание);
		
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Процедура УстановитьТекстНадписиРегламентнойНастройки()
	
	Перем ТекстЗаголовка, ТекстРасписания, ЗаданиеАктивно;
	
	мЖирныйШрифт = Новый Шрифт(,,Истина);
	мОбычныйШрифт = Новый Шрифт();
	
	УстановитьЗначенияПеременныхРегламентныхНастроек();
	
	ПолучитьТекстЗаголовкаИРасписанияРегламентнойНастройки(мРегламентноеЗадание, ТекстЗаголовка, ТекстРасписания, ЗаданиеАктивно);

	Элементы.НадписьРасписаниеРегламентногоЗаданияНастройки.Заголовок 	= ТекстРасписания;
	Элементы.НадписьРасписаниеРегламентногоЗаданияНастройки.Шрифт 		= ?(ЗаданиеАктивно И Объект.ИспользоватьРегламентныеЗадания, мЖирныйШрифт, мОбычныйШрифт);
    	
КонецПроцедуры

&НаСервере
Процедура ПолучитьСоздатьРегламентноеЗадание()
		
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Возврат;
	КонецЕсли;
	
	Если мРегламентноеЗадание = Неопределено Тогда
		
		мРегламентноеЗадание = НайтиРегламентноеЗаданиеПоНастройке();
		
	КонецЕсли;
	
	МассивПараметров = Новый Массив;
	МассивПараметров.Добавить(Объект.Ссылка);
			
	Если мРегламентноеЗадание = Неопределено Тогда
		
		мРегламентноеЗадание = РегламентныеЗадания.СоздатьРегламентноеЗадание("абс_ВыгрузкаДанныхПУБ77");
						
		мРегламентноеЗадание.Наименование = Объект.Наименование;
	        		
	КонецЕсли;
	
	мРегламентноеЗадание.Использование = Ложь;
		
	мРегламентноеЗадание.Параметры = МассивПараметров;

	мРегламентноеЗадание.Записать();
	
	Объект.РегламентноеЗадание = мРегламентноеЗадание.УникальныйИдентификатор;	
	
КонецПроцедуры

&НаСервере
Функция ПолучитьРасписаниеРегламентногоЗадания()
	
	ПолучитьСоздатьРегламентноеЗадание();
	
	Возврат мРегламентноеЗадание.Расписание;
	
КонецФункции

&НаСервере
Процедура УстановитьРасписаниеРегламентногоЗадания(Знач Расписание)
	
	ПолучитьСоздатьРегламентноеЗадание();

	мРегламентноеЗадание.Расписание = Расписание;
	
	мРегламентноеЗадание.Использование = Ложь;
	
	мРегламентноеЗадание.Записать();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьЗначенияПеременныхРегламентныхНастроек();	
	
	УстановитьТекстНадписиРегламентнойНастройки();

КонецПроцедуры

&НаКлиенте
Процедура НадписьРасписаниеРегламентногоЗаданияНастройкиНажатие(Элемент)
	
	Если НЕ Объект.ИспользоватьРегламентныеЗадания Тогда		
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Предупреждение("Настройка не записана, сначала необходимо записать настройку.");
		Возврат;
	КонецЕсли;
	
	Расписание = ПолучитьРасписаниеРегламентногоЗадания();
	
	Диалог = Новый ДиалогРасписанияРегламентногоЗадания(Расписание);
		
	Если Диалог.ОткрытьМодально() Тогда
			
		УстановитьРасписаниеРегламентногоЗадания(Диалог.Расписание);
		
		УстановитьТекстНадписиРегламентнойНастройки();
		
	КонецЕсли;
				
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	УстановитьЗначенияПеременныхРегламентныхНастроек();	
	
	Если НЕ мРегламентноеЗадание = Неопределено Тогда
		
		мРегламентноеЗадание.Использование = Объект.ИспользоватьРегламентныеЗадания;
		мРегламентноеЗадание.Записать();
		
		Объект.РегламентноеЗадание = мРегламентноеЗадание.УникальныйИдентификатор;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаВыполнитьОбменПоНастройке(Команда)
			
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Предупреждение("Настройка не записана, сначала необходимо записать настройку.");
		Возврат;
	КонецЕсли;
	
	КомандаВыполнитьОбменПоНастройкеНаСервере();
	
	Сообщить("Обмен по настройке: " + СокрЛП(Объект.Ссылка) + " завершен.");
	
КонецПроцедуры

&НаСервере
Процедура КомандаВыполнитьОбменПоНастройкеНаСервере()
	
	абс_ОбменДаннымиСервер.абс_ВыгрузкаДанныхПУБ77(Объект.Ссылка);
	
КонецПроцедуры
